/***************************************************************************
****************广工信工18复试单片机第2题参考程序***************************
****************************************************************************
*******程序版本：V2.0
*******程序日期：2019-3-9
*******程序作者：小一
*******外部晶振:12M
*******交流QQ：1262227291
****************************************************************************/
#include <reg51.h>

sbit key = P3^1;             
sbit led = P3^0;   
unsigned char num,flag = 0; //定义计数值num 和灯的标志位flag

void T0_Init();             //声明定时器0初始化函数
void GPIO_Init();           //声明GPIO初始化函数
void Time_scan();           //声明计数时间检测函数
void Key_scan();            //声明按键检测函数

void main()
{
	 T0_Init();               //初始化定时器T0
	 GPIO_Init();             //初始化Led和key的GPIO
	 while(1)
	 {
		 Key_scan();            //检测是否有按键按下
	 }
}

void T0_Init()              //定时器0初始化函数
{
  TMOD = 0x01;
	TH0 = (65536-10000)/256;  //定时器0装初值
	TL0 = (65536-10000)%256;  //12M晶振下计数1000次即10ms
	EA = 1;
	ET0 = 1;
}

void GPIO_Init()          //LED和KEY初始化函数
{
	key = 1;
	led = 1;
}

void Key_scan()           //按键检测函数
{
	if(key == 0)            //如果按键按下. 注意：此处不能消抖，消抖需要软件延时，		                 
	 {                      //此题中的按键检测时间是从按下的那一刻开始计时的
		 TR0 = 1;             //开定时器0
	 }
	 else                   //否则
	 {
		 TR0 = 0;             //关闭定时器0
		 num = 0;             //计数清零防止未按到响应计数累积  （*****划重点：这是我寒假调了一天都没想出来，感谢群友）
	 }
}
	 
void Time_scan()           //计数时间检测函数
{
	if(flag == 0&&num == 20)
		{ 	
			led = 0;
			flag = 1;            //灯亮标志
			num = 0;          
			TR0 = 0;             //关定时器0
			while(key==0);	     //松手检测	
		}
	if(flag == 1&&num == 200)
		{
			led = 1;
			flag = 0;            //灯灭标志
			num = 0;
			TR0 = 0;		         //关定时器0
			while(key==0);       //松手检测
		}			
	else
	{
		TR0 = 0;               //关定时器0
	}
}

void T0_time() interrupt 1     //定时器0中断服务程序
{
	TH0 = (65536-10000)/256;     //定时器0重装初值
	TL0 = (65536-10000)%256;
	num++;
	Time_scan();                 //中断内扫描按键时间检测
}
